In [5]:
import pandas as pd

df = pd.read_csv('stock_data.csv')

In [6]:
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [ ]:
# When we have extra rows on top of csv
# df = pd.read_csv('stock_data.csv',skiprows=1) # skip the 1st row
# df = pd.read_csv('stock_data.csv',header=2) # if header starts from 2nd row
# df = pd.read_csv('stock_data.csv',header=None,names=['ticker','eps','revenue','price','people']) # if header is not present in the file

In [8]:
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [9]:
# if csv file is big and we just want to read limited rows

df = pd.read_csv('stock_data.csv',nrows=3)

In [10]:
df

  tickers    eps  revenue  price      people
0   GOOGL  27.82       87    845  larry page
1     WMT   4.61      484     65        n.a.
2    MSFT  -1.00       85     64  bill gates

In [12]:
## if some cells are not avaliable 
df = pd.read_csv('stock_data.csv',na_values=['not avaliable','n.a.',-1]) # if will convert column with value not avaliable and n.a. into NaN values

In [16]:
df = pd.read_csv('stock_data.csv',
                 na_values= {
                     'eps':['not avaliable','n.a.'],
                     'revenue':['not avaliable','n.a.',-1],
                     'people':['not avaliable','n.a.']
                 })

In [17]:
df

  tickers            eps  revenue price         people
0   GOOGL          27.82     87.0   845     larry page
1     WMT           4.61    484.0    65            NaN
2    MSFT             -1     85.0    64     bill gates
3    RIL   not available     50.0  1023  mukesh ambani
4    TATA            5.6      NaN  n.a.     ratan tata

In [18]:
df.to_csv('new.csv')

In [19]:
df.to_csv('new.csv',index=False)

In [20]:
df.columns

Index(['tickers', 'eps', 'revenue', 'price', 'people'], dtype='object')

In [22]:
df.to_csv('new.csv',columns=['tickers','revenue'],index=False)

In [ ]:
df.to_csv('new.csv',index=False, header=False) # Store the data with not header present

### Not using EXcel File

In [23]:
df = pd.read_excel('stock_data.xlsx')
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [24]:
df = pd.read_excel('stock_data.xlsx',"Sheet1")

In [26]:
def convert_people_cell(cell):
    if cell == "n.a.":
        return 'sam walton'
    
    return cell
df = pd.read_excel('stock_data.xlsx',"Sheet1",converters={
    'people':convert_people_cell
})

df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65     sam walton
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [28]:
df.to_excel("new.xlsx",sheet_name='stocks')

In [ ]:
df.to_excel('new.xlsx',sheet_name="stocks",startrow=1,startcol=2)